
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчетСуммыСтрокиТоваров(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчетСуммыСтрокиТоваров(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ПересчетСуммыСтрокиТоваров(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

&НаКлиенте
Процедура ПересчетСуммыСтрокиТоваров(СтрокаТабличнойЧастиТовары)
	СтрокаТабличнойЧастиТовары.Сумма = СтрокаТабличнойЧастиТовары.Количество * СтрокаТабличнойЧастиТовары.Цена;
КонецПроцедуры

#КонецОбласти
